package com.ict08.network;

public class Ex05 {
	// XML(Extensible Markup Language, 확장 마크업 언어)
	//	=>  HTML을 획기적으로 개선하여 만든 언어
	//		HTML은 정해진 태그를 사용해서 웹 페이지를 만듦
	//		[정해진 태그] ??
	//		태그 : <시작태그   속성="값"> 텍스트 </끝태그>, 
	//			태그의 의미는 w3c에서 이미 정해놨음 !
	
	//	그러나 XML은 "사용자가 태그를 만들고" 그 태그의 의미를 부여할 수 있다.
	//		XML은 반드시 첫 줄에 사용 ==> <?xml version="1.0" encoding="UTF-8" ?>
	//		xml은 데이터를 전달하거나 환경설정할 때 자주 사용된다.
	// ====================================================================================
	
	// JSON(Java Script Object Notation): "키-값 쌍"으로 이루어진 데이터 오브젝트를 전달하기 위해
	//			인간이 읽을 수 있는 텍스트를 사용하는 개방형 표준 포맷이다.
	
/*	다음은 한 사람에 관한 정보를 갖는 JSON객체이다.
	 키-값 쌍(이름:값)의 패턴으로 표현된다.
	 {
		"이름": "홍길동",
		"나이": 25,
		"성별": "여",
		"주소": "서울특별시 양천구 목동",
		"특기": ["농구", "도술"],									// 키 : 값(배열)
		"가족관계": {"#": 2, "아버지": "홍판서", "어머니": "춘섬"}, // 키 : 값(json)
		"회사": "경기 수원시 팔달구 우만동"
	 }
*/	
	
}
